## [PMM](https://opsx-poc.app.spacelift.io/stack/pmm/run/01H2RW81E6KNSBVDF9C941RMQT) plan logs

<details>
<summary>Click here to expand</summary>

```
[01H2RSVWRTFAWXSW40VDME60A0] Planning changes with 0 custom hooks...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_instance.web will be created
  + resource "aws_instance" "web" {
      + ami                                  = "ami-002070d43b0a4f171"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t3.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = (known after apply)
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + subnet_id                            = "subnet-78bfd00f"
      + tags                                 = {
          + "Foo"  = "Bar"
          + "Name" = "PMM Host"
        }
      + tags_all                             = {
          + "Foo"  = "Bar"
          + "Name" = "PMM Host"
        }
      + tenancy                              = (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = [
          + "sg-02548f90c9871bdc5",
        ]
    }

Plan: 1 to add, 0 to change, 0 to destroy.

[01H2RSVWRTFAWXSW40VDME60A0] Changes are GO
[01H2RSVWRTFAWXSW40VDME60A0] Uploading the list of managed resources...
[01H2RSVWRTFAWXSW40VDME60A0] Please be aware that Run changes calculation includes Terraform output changes.
[01H2RSVWRTFAWXSW40VDME60A0] Resource list upload is GO
[01H2RSVWRTFAWXSW40VDME60A0] Generating JSON representation of the plan...
[01H2RSVWRTFAWXSW40VDME60A0] JSON representation is GO
[01H2RSVWRTFAWXSW40VDME60A0] Loading custom plan policy inputs...
[01H2RSVWRTFAWXSW40VDME60A0] 0 custom plan policy inputs found
[01H2RSVWRTFAWXSW40VDME60A0] No plan policies to evaluate
```

</details>